johnR46/BellLab_STM32/TestKey/MainB-1/USER/main.c

//#include "stm32f10x.h"
#include "systick.h"
#include <ctype.h> //use toupper
#include <stdio.h>
#include <string.h>
#include <inttypes.h>
#include <stdlib.h> //strtol
#include "stm32f10x_spi.h"


#define RCC_APB2Periph_GPIO_SPI_FLASH_CS      RCC_APB2Periph_GPIOD
#define SPI_DISPLAY_CS_PORT                     GPIOD
#define SPI_DISPLAY_CS_PIN                      GPIO_Pin_4

//--------------------------------spi display----------------------------------
#define SPI_DISPLAY_CS_LOW()       GPIO_ResetBits(GPIOD, GPIO_Pin_4) //SPI_FLASH_CS_LOW
#define SPI_DISPLAY_CS_HIGH()      GPIO_SetBits(GPIOD, GPIO_Pin_4)   //SPI_FLASH_CS_HIGH


//--------------------------------spi flash------------------------------------
#define SPI_FLASH_CS_LOW()     GPIO_ResetBits(GPIOA, GPIO_Pin_4)
#define SPI_FLASH_CS_HIGH()    GPIO_SetBits(GPIOA, GPIO_Pin_4)

void writeFlash(int address, int size);
void writeFlash2(int address, int size);
int addressWriteFlashTemp = 0x0;
int strLength = 0;
int countSector4096 = 0;
int countSector = 0;
int addressSector = 0x00;
int endReadFile = 0;
char buffer22Char[22];
int pointer22char = 0;
int pointerSector = 0;
int pointerSectorStatus = 0;
int jumpLECR = 0;
int AmountSector = 0;
int AmountSectorT = 0;
int NextLenghtLess20 = 0;
int NextPoint = 0;
int maxLengthLoopL22 = 22;
int countLFTwoStep = 0;
int TempPointer22char = 0;
int varForLoop = 0;
int readPreviousSector = 0;
int countLengthInLine = 0;
int seeCur = 0;
int breakOpenDir = 0;

uint16_t * str;
char buffer[6];
unsigned int BLEConBuffer[30];
int keyCodeRecieve[7];
int countKey = 0;
int seeHead = 0;
int maxData = 7;
int i = 0, j = 0, k = 0;
int i1 = 0, j1 = 0, count1 = 0; //uart2
int uart2Buffer = 0;
int maxSize = 5;
int count = 0;
int count2 = 0;
int Hex;
int isHex = 0; // if equal 1 is hex, or equal 2 is Switch
int itFirst = 0;
int BLEConn = 0;
int pushToDisplay = 0;
int countConn = 0;

int bufferKey3digit[3] = {0};

int hexbuffer = 0;
int hexPrep = 0;
int SeeHead = 0;
int dataLength = 0;

//---------------------- menu variable ----------------------
int count_menu = 1;
int maxMenu = 8;
int menu[6] = {0x01, 0x02, 0x04, 0x80, 0x04, 0x02};

int countMenuInReadMode = 0;

int st_bluetooth[] = {0x43, 0x07, 0x25, 0x11, 0x1e, 0x15, 0x15, 0x1e, 0x13}; //bluetooth
int st_0[] = {0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff};
int st_notepad[] = {0x1d, 0x15, 0x1e, 0x11, 0x0f, 0x01, 0x19};//notepad
int st_notepad_mode[] = {0x1d, 0x15, 0x1e, 0x11, 0x0f, 0x01, 0x19, 0x00, 0x0d, 0x15, 0x19, 0x11};
int st_filemanage[] = {0x0b, 0x0a, 0x07, 0x11, 0x0d, 0x01, 0x1d, 0x01, 0x1b, 0x11};
int st_read[] = {0x17, 0x11, 0x01, 0x19};
int st_usbconnect[] = {0x25, 0x0e, 0x03, 0x00, 0x09, 0x15, 0x1d, 0x1d, 0x11, 0x09 , 0x1e};
int st_clock[] = {0x09, 0x07, 0x15, 0x09, 0x05};
int st_calcu[] = {0x09, 0x01, 0x07, 0x09, 0x25, 0x07, 0x01, 0x1e, 0x15, 0x17};
int st_tools[] = {0x1e, 0x15, 0x15, 0x07, 0x0e};
int fullScreen[] = {0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff};
int read_mode[] = {0x57, 0x51, 0x41, 0x59, 0x00, 0x4d, 0x55, 0x59, 0x51};
int bigL[] = {0x47, 0x47, 0x47, 0x47, 0x47, 0x47, 0x47, 0x47, 0x47, 0x47, 0x47, 0x47, 0x47, 0x47, 0x47, 0x47, 0x47, 0x47, 0x47};
int mode_1[4] = {0x00, 0x01, 0x02};
int mode = 0 ; //1,2,3,4,5,6,7,8

int checkKeyError = 0;
int keyCode = 0;
int previousMode = 0;


//----------------------------------------- BLE data --------------------------------------------------//
////////////////////////////////////////////
//54 53 53 4d 20 56 31 2e 30  --TSSM V1.0 //
//53 4c 52 49 20 56 31 2e 30  --SLRI V1.0 //
////////////////////////////////////////////
int connectData[] = {0xff, 0xff, 0xa2, 0x0b, 0x16, 0x14, 0x10, 0x53 , 0x4c , 0x52 , 0x49 , 0x20 , 0x56 , 0x31 , 0x2e , 0x30};
int navRight[] = {0xff, 0xff, 0xa6, 0x03, 0x00, 0x08, 0x00};
int navLeft[] = {0xff, 0xff, 0xa6, 0x03, 0x00, 0x04, 0x00};

//-----------------------------------------End BLE data-----------------------------------------------//
//-----------------------------------------ch370s data------------------------------------------------//
int changeBaudRateByte[] = {0x00, 0x57, 0xab, 0x02, 0x03, 0xcc};
int countSector512 = 0;
int countRoundSector512 = 0;
int countCounitueRead = 0; //512 ,round =24
char bufferFromRead[25] = "";
char bufferPrevoisRead[1000][25];
int CountbufferFromRead = 0;
int startRead = 0;
int countPageWhenRead = 0;
int continueReadFile = 0;
int openFileStatus = 0;
int readstatus = 0;
int becon = 0;
int checkConnection[] = {0x00, 0x57, 0xab, 0x06, 0x57};
int setSDCard[] = {0x00, 0x57, 0xab, 0x15, 0x03};//+
int USBDiskMount[] = {0x00, 0x57, 0xab, 0x31};
int setFileName[15] = {0x00, 0x57, 0xab, 0x2f, 0x2f}; // for direct open file
int setFileNameA[] = {0x00, 0x57, 0xab, 0x2f, 0x2f, 0x42, 0x2e, 0x54, 0x42, 0x54, 0x00};
int setFilenameForFunction[] = {0x00, 0x57, 0xab, 0x2f}; // use vie function set file name
int setFileNameLength = 5;
int DiskconnectStatus[] = {0x00, 0x57, 0xab, 0x03}; //+
int openDirStatus = 0;
//--readmode
char dataTemp512[512];
int countdataTemp512 = 0;
int waitEnd = 0; // 10
int lastAscii = 0;

int setAllName[] = {0x00, 0x57, 0xab, 0x2f, 0x2a, 0x00};//*
int setAllName3[] = {0x00, 0x57, 0xab, 0x2f, 0x2a, 0x00};//*.TXT
int setAllName2[] = {0x00, 0x57, 0xab, 0x2f, 0x41, 0x2e, 0x54, 0x42, 0x54, 0x00};//*.TXT
int FileOpen[] = {0x00, 0x57, 0xab, 0x32};
int enumgo[] = {0x00, 0x57, 0xab, 0x33};
int data0[] = {0x00, 0x57, 0xab, 0x27};
int sendNull[] = {0};
int FileCreate[] = {0x00, 0x57, 0xab, 0x34};
int FileUpdate[] = {0x00, 0x57, 0xab, 0x3d};
int FileClose[] = {0x00, 0x57, 0xab, 0x36, 0x01};
int FilePointer[] = {0x00, 0x57, 0xab, 0x39, 0x00, 0x00, 0x00, 0x00};
int FilePointerend[] = {0x00, 0x57, 0xab, 0x39, 0xff, 0xff, 0xff, 0xff};
int searchStep = 0;
int stepCount = 0;
int r_count = 0;
int nextAgain = 0;
int countFileLegth = 0;
char prepareNameToOpen[] = "";
int FileWrite[] = {0x00, 0x57, 0xab, 0x2d};

int FileWrite2[] = {0x00, 0x57, 0xab, 0x2d, 0x1e, 0x13, 0x0A, 0x0E, 0x20, 0x0E, 0x00, 0x01, 0x0F, 0x0F, 0x11, 0x1D, 0x19, 0x00, 0x0B, 0x0A, 0x07, 0x11};
int ResetAll[] = {0x00, 0x57, 0xab, 0x05};
int SetByteRead[] = {0x00, 0x57, 0xab, 0x3a, 0x80, 0x00}; //15 = 21 character
int SetByteRead6char[] = {0x00, 0x57, 0xab, 0x3a, 0x06, 0x00};
int ReadData[] = {0x00, 0x57, 0xAB, 0x27};
int continueRead[] = {0x00, 0x57, 0xab, 0x3b};
int command_ = 0;
int DirName[] = {0x00, 0x57, 0xab, 0x2f, 0x2f, 0x54, 0x45, 0x53, 0x54, 0x00};

int SwitchEndFileName = 0;
int endFileName = 0;

int unicodeTable[] = {
  0x00, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
  0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
  0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
  /*32-47*/
  0x00, 0x2e, 0x10, 0x3c, 0x2b, 0x3f, 0x2f, 0x20, 0x37, 0x3e, 0x14, 0x16, 0x02, 0x24, 0x04, 0x32,
  /*0-9*/
  0x2c, 0x21, 0x23, 0x29, 0x39, 0x31, 0x2b, 0x3b, 0x33, 0x2a,

  0x12, 0x06, 0x30, 0x36, 0x18, 0x22, 0x5c,
  /*A-Z*/
  0x41, 0x43, 0x49, 0x59, 0x51, 0x4b, 0x5b, 0x53, 0x4a, 0x5a, 0x45, 0x47, 0x4d, 0x5d, 0x55, 0x4f,
  0x5f, 0x57, 0x4e, 0x5e, 0x65, 0x67, 0x7a, 0x6d, 0x7d, 0x75 /*Z*/,
  0x77, 0x4c, 0x7e, 0x6e, 0x78, 0x1c, /*symbol*/
  0x01, 0x03, 0x09, 0x19, 0x11, 0x0b, 0x1b, 0x13, 0x0a, 0x1a, 0x05, 0x07, 0x0d, 0x1d, 0x15, 0x0f,
  0x1f, 0x17, 0x0e, 0x1e, 0x25, 0x27, 0x3a, 0x2d, 0x3d, 0x35, /*z*/
  0x37, 0x33, 0x3e, 0x2e, 0xff /*{|}*/
};
