johnR46/BellLab_STM32/TestKey/MainB-1/USER/main.c
//------------------------------------------ ch370t data ------------------------------------//'
char filelist[10][15];
int seaching = 1; //for seaching file




//-------------------------------------------------------------------------------------------//
//---------------------------------------------
#ifdef __GNUC__
/* With GCC/RAISONANCE, small printf (opti
  on LD Linker->Libraries->Small printf
   set to 'Yes') calls __io_putchar() */
#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#endif /* __GNUC__ */

/* Private define ------------------------------------------------------------*/
#define ADC1_DR_Address    ((u32)0x4001244C)

/* Private function prototypes -----------------------------------------------*/


///------------------------------------spi---------------------------------//
void keyboardMode(void);
void SendCommandToBLE2(int);
void Init_SPI(void);
void delay_SPI(void);
void sentdata_cell(int data);
void cell_sentdata(int cell);
uint8_t Flash_ReadWriteByte2(uint8_t data);
/*------------------------------------------------------------------------*/
void GPIO_Configuration(void);
void USART1_Configuration(void);
void USART2_Configuration(void);
void USART3_Configuration(void);
void USART3_Configuration2(void);
void UART4_Configuration(void);
void ADC_Configuration(void);
void sendUart(int);
void UARTSend(const unsigned char *pucBuffer, unsigned long ulCount);
void Uart2ReceiveKeyCode(void);
void ConnectBLE(void);
void BluetoothMode(void);
void SendCommandToBLE(int data[], int sizeOfData);

void printDot(int data[], int size);
void stringToUnicodeAndSendToDisplay(char * str);

void clearDot(void);
void menu_s(void);
void menu_CH376(void); //for ch376s
void caseMenu(int);
void copy_string(char *target, char *source);
int fileWrite(int k, char *filename, char * string);

const char * fileName(void);

char DataForWrite[32] = "";
char DataForWrite_aftersort[32] = "";
const char* FileName_buffer = DataForWrite;

//--- sd card---//
void ReadFile(void);
int createFile(char * name);
int CreateFile__ = 1;
void searchFile(void);
void appendFile(void);
void SendCH370(int data[], int);
void changeBuatRate(void);
void setFilename(char *name);

// john function
void notepad(void);
int mapCursor(int, int, int);
int checkBit(int);
//----end john func---
//-----------------------------------mode--------------------------------//

/* Private variables ---------------------------------------------------------*/
float AD_value;
vu16 ADC_ConvertedValue;

//------------select uart---------/

int sendUart1 = 0;
int sendUart2 = 0;
int sendUart3 = 0;
int sendUart4 = 0;

/*-----------------------------spi flash------------------------------------------*/
extern void SPI_Flash_Init(void);

extern unsigned char SST25_buffer[];
extern unsigned char SST25_buffer99[];

unsigned char SST25_buffer88[] = {0x0a, 0x0d};
/* Private define ------------------------------------------------------------*/
#define TxBufferSize1   (countof(TxBuffer1) - 1)
#define RxBufferSize1   (countof(TxBuffer1) - 1)

/* Private macro -------------------------------------------------------------*/
#define countof(a)   (sizeof(a) / sizeof(*(a)))

/* Private variables ---------------------------------------------------------*/

uint8_t TxBuffer1[] = "SPI SST25VF016B Example: This is SPI DEMO, 999888888888888888888888888888";
uint8_t NbrOfDataToTransfer1 = TxBufferSize1;

void  Delay(uint32_t nCount); //--delay spi
//GPIO_InitTypeDef GPIO_InitStructure;
int16_t USART_FLAG;

extern void SST25_W_BLOCK(uint32_t addr, u8 *readbuff, uint16_t BlockSize);
extern void SST25_R_BLOCK(uint32_t addr, u8 *readbuff, uint16_t BlockSize);

// John global Value
char str1[4096];
char str2[20];   // normal struct endRight
char str3[20];   // normal struct (endLeft) LeftMax - LeftMin
char ch[1];
int mapcur = 0;
int cur = 0;
int statusmid = 0;
char strfirst[20];
char strmiddle[20];
int Curmid = 0;
char strlast[20];
int tempcur;
int mapcur1;
int mapcur2;
char *L;
int shiftpoint = 0;
int shiftstatus = 0;
int point = 0;
char left[22];
char right[22];


/*----------------------------------------------------------------------------*/

void configFlash(void) {
  SPI_InitTypeDef  SPI_InitStructure;
  SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
  SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
  SPI_InitStructure.SPI_CRCPolynomial = 7;
  SPI_Init(SPI1, &SPI_InitStructure);
}
void configDisplay(void) {
  SPI_InitTypeDef  SPI_InitStructure;
  SPI_InitStructure.SPI_Direction = SPI_Direction_1Line_Tx;
  SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
  SPI_InitStructure.SPI_NSS = SPI_NSS_Hard ;
  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_64;
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
  SPI_InitStructure.SPI_CRCPolynomial = 7;
  SPI_Init(SPI1, &SPI_InitStructure);
}


/*******************************************************************************
  Function Name  : main
  Description    : Main program
  Input          : None
  Output         : None
  Return         : None
  Attention      : None
*******************************************************************************/
void changeBuatRate() {
  SendCH370(changeBaudRateByte, sizeof(changeBaudRateByte));
  delay_ms(50);
  if (USART_GetITStatus(USART3, USART_IT_RXNE) ) {
    i1 = USART_ReceiveData(USART3);
    printf("%c\r\n", i1);
  }
  printf("change 115200\r\n");
}
void prepareSD() {
  int preStatus = 1;
  command_++;
  while (preStatus) {
    if (command_ == 1) {
      SendCH370(checkConnection, sizeof(checkConnection));
      printf(" check connecttion \r\n");
      command_++; //2
      delay_ms(50);
    } else if (command_ == 2) {
      SendCH370(setSDCard, sizeof(setSDCard));
      printf(" set sd card\r\n");
      command_++; //4
      delay_ms(50);
    } else if (command_ == 3) {
      SendCH370(USBDiskMount, sizeof(USBDiskMount));
      printf(" usb disk mount \r\n");
      command_++; //6
      delay_ms(50);
    } else if (command_ == 4) {
      SendCH370(setAllName, sizeof(setAllName));
      printf(" set all file \r\n");
      delay_ms(80);
      command_++; //10
    } else if (command_ == 5) {
      SendCH370(FileOpen, sizeof(FileOpen));
      printf(" file open \r\n");
      delay_ms(80);
      command_++; //10
    } else if (command_ == 6) {
      SendCH370(FileClose, sizeof(FileClose));
      printf(" File Close \r\n");
      delay_ms(80);
      command_++; //10
      preStatus = 0;
    }
    if (USART_GetITStatus(USART3, USART_IT_RXNE) ) {
      i1 = USART_ReceiveData(USART3);
      printf("%x-%d\r\n", i1, i1);
    }
  }
}
int main(void)
{
  /* Configure the GPIO ports */
  GPIO_Configuration();             //if config this can't use printf
  //----------------------------------------------------------------------------------------------------------
  UART4_Configuration(); //9600
  USART2_Configuration(); //115200
  USART1_Configuration(); //115200
  USART3_Configuration(); //9600
  Init_SPI();
  delay_init();
  sendUart(1);
  configDisplay();
  printDot(st_0, sizeof(st_0));
  delay_ms(1200);
  stringToUnicodeAndSendToDisplay("Notepad");
  //****************** check dot****************
  printf("---------------- \r\n");

