johnR46/BellLab_STM32/TestKey/MainB-1/USER/main.c
  prepareSD();
  command_ = 0;
  command_ ++;
  while (1) {


    notepad();






  }
}
void createFileAndWrite(char * fname) {
  command_ = 0;
  command_++;
  while (1) {
    if (createFile(fname) == 1) {
      printf("Create File TA99 success\r\n");
      break;
    }
  }
  SendCH370(ResetAll, sizeof(ResetAll));
  delay_ms(100);
  command_ = 0;
  command_++;
  while (1) {
    if (fileWrite(0, fname, str1) == 1) {
      break;
    }
  }
}
//---------from john------
int  mapCursor(int P1, int P2, int P3) {
  if (P1 != 0) {
    return  checkBit(P1);
  }
  else if (P2 != 0) {
    return  checkBit(P2) + 8;
  }
  else if (P3 != 0) {
    return  checkBit(P3) + 16;
  } else {
    return 0;
  }
}
int checkBit(int input) {
  int i;
  for (i = 0; i <= 8; i++) {
    if (input == 1)
      break;
    input = input >> 1;
  }
  return i;
}
void saveName() {
  int saving = 1;
  char nameBuff[15];
  int cc = 1;
  memset(nameBuff, 0, 15);
  nameBuff[0] = '/';
  countKey = 0;
  keyCode = 0;
  seeCur = 0;
  while (saving == 1) {
    if (USART_GetITStatus(USART2, USART_IT_RXNE)) {
      //----------------------------- uart to key--------------------------------
      uart2Buffer = USART_ReceiveData(USART2);                                //-
      if (uart2Buffer == 0xff && SeeHead == 0) {                              //-
        SeeHead = 1;                                                          //-
        countKey = 0;                                                         //-
      }
      if (countKey == 2 && uart2Buffer == 0xa4) { // if cursor
        seeCur = 1;
      }
      if (countKey >= 4 && countKey <= 6) {                                   //-
        bufferKey3digit[countKey - 4] = uart2Buffer;                          //-
      }

      if (countKey == 2)
      {
        checkKeyError = uart2Buffer;
      }
      countKey++;

      if (countKey >= maxData) {
        seeHead = 0;
        if (checkKeyError == 0xff) { //check error key
          //printf("Key Error");
          countKey = 0;
          SeeHead = 0;
        }
        if ((bufferKey3digit[0] == 0x00 && bufferKey3digit[1] == 0x20 && bufferKey3digit[2] == 0x00) || (bufferKey3digit[0] == 0x00 && bufferKey3digit[1] == 0x00 && bufferKey3digit[2] == 0x04)) { //back to notepad
          saving = 0;

        }
        if (bufferKey3digit[2] == 2 || bufferKey3digit[1] == 0x10) { // save file
          printf("\r\n enter \r\n");
          i = 0;
          while (nameBuff[i] != '\0') {
            if (nameBuff[i] >= 97) {
              nameBuff[i] = nameBuff[i] - 32;
            }
            i++;
          }
          strcat(nameBuff, ".TBT");
          printf("\r\nSaving file :%s\r\n", nameBuff);
          createFileAndWrite(nameBuff);
          saving = 0;
        }
        else if (bufferKey3digit[0] == 0x80) { // delete file name
          if (cc > 1) { // steel save root /
            nameBuff[cc] = '\0';
            cc--;
            printf("Delete:%s \r\n", nameBuff);
          }
        }
        else // enter file name
        {
          printf("See key %x,%x,%x\r\n", bufferKey3digit[0], bufferKey3digit[1], bufferKey3digit[2]);
          for ( i = 0; i < 255; i++) {
            if (bufferKey3digit[0]  == unicodeTable[(char) i]) {
              break;
            }
          }
          if (i >= 33 && i < 126 && cc <= 10) { // name length less than 10
            nameBuff[cc] = i;
            printf("Filename:%s\r\n", nameBuff);
            cc++;
          }
        }
        /*-----------------------
          print file name here
          -----------------------*/
        countKey = 0;
        keyCode = 0;
        seeCur = 0;
      }
    }
  }
}
void notepad() {
	
 
  if (USART_GetITStatus(USART2, USART_IT_RXNE)) {
    //----------------------------- uart to key--------------------------------
    uart2Buffer = USART_ReceiveData(USART2);                                //-
    if (uart2Buffer == 0xff && SeeHead == 0) {                              //-
      SeeHead = 1;                                                          //-
      countKey = 0;                                                         //-
    }
    if (countKey == 2 && uart2Buffer == 0xa4) { // if cursor
      seeCur = 1;
    }
    if (countKey >= 4 && countKey <= 6) {                                   //-
      bufferKey3digit[countKey - 4] = uart2Buffer;                          //-
    }
    if (countKey == 2) //0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
    {
      checkKeyError = uart2Buffer;
    }
    countKey++;
    // ---------------------------- end uart to key ----------------------------
    // printf("[%x]\r\n",uart2Buffer);
  }
  if (countKey >= maxData) { //Recieve & checking key
    seeHead = 0;
    printf("\r\n==========See key(Hex) %x,%x,%x ================\r\n", bufferKey3digit[0], bufferKey3digit[1], bufferKey3digit[2]);

    //printf("checkKey :%x\r\n",checkKeyError);
    if (checkKeyError == 0xff) { //check error key
      //printf("Key Error");
      countKey = 0;
      SeeHead = 0;
    }
    //printf("%d\r\n",sizeof(mode_1)/sizeof(int));
    //////////////////////////////////menu selector ///////////////////////////////////

    if (bufferKey3digit[1] != 0 || bufferKey3digit[2] != 0) { //joy menu
      // ---------------------------- to key code -----------------------------
      if (bufferKey3digit[2] == 1 || bufferKey3digit[2] == 0x20) { // joy is down
        keyCode = 40; // arrow down
        // command_++;
      }
      else if (bufferKey3digit[1] == 1 || bufferKey3digit[1] == 3 || bufferKey3digit[1] == 2) { // joy is up
        keyCode = 55;  // arrow up
      }
      else if (bufferKey3digit[1] == 32 || bufferKey3digit[2] == 4) {
        keyCode = 8;
      }
    }
      if (bufferKey3digit[1] == 3  && bufferKey3digit[0] == 0) { // joy is up
        keyCode = 32;  // arrow up
      } 
           
      if (seeCur == 1) {  // selector mapcur
        mapcur =  mapCursor(bufferKey3digit[0], bufferKey3digit[1], bufferKey3digit[2]);  
        printf("\r\n------------------ setcur = %d ----------------------------\r\n ", mapcur);
      }
    
      if ((bufferKey3digit[0] != 0 && seeCur != 1)) {
			   for ( i = 0; i < 255; i++) {
        if (bufferKey3digit[0]  == unicodeTable[(char) i]) {
           printf("%c",i);
          break;
        }
      }
			}
      
     

      countKey = 0;
      keyCode = 0;
      seeCur = 0;
    
