johnR46/BellLab_STM32/TestKey/MainB-1/USER/main.c
          if (countSector512 >= 4) { //512

            /*dataTemp512[countdataTemp512] = i1;
              countdataTemp512++;*/
            // printf("`````````````````````````one sector````````````````\r\n%s\r\n", dataTemp512);
            // printf("---------------------------------------------------\r\n");
            command_ = 95;
            //push to flash

            for (i = addressWriteFlashTemp; i < addressWriteFlashTemp + 512; i++) {
              SST25_buffer[i - (4096 * countSector)] = dataTemp512[i - addressWriteFlashTemp];
            }
            countSector4096++;
            //writeFlash(addressWriteFlashTemp);
            addressWriteFlashTemp += countdataTemp512;
            if (countSector4096 >= 8) { // 8
              // write to flash here
              writeFlash(addressSector, 4096);
              Delay(0xffff);
              stringToUnicodeAndSendToDisplay("Reading....");
              addressSector += 4096;
              countSector4096 = 0;
              //--------------------------------------------------------------------------------------------
              //check this value `addressWriteFlashTemp`--
              //--------------------------------------------------------------------------------------------
              countSector++;
              // printf("/////////////////////////////////////////////////////%s\r\n////////////////////////", SST25_buffer);
              // printf("****************address:%d********************", addressSector);
              //while(1){}
            }
            //  printf("-------------------------%d--------------------------\r\n", addressWriteFlashTemp);

            //--- reset temp sector---//
            countdataTemp512 = 0;
            countSector512 = 0;
          } else {
            command_ = 6;
          }
          /*printf("data is :%s\r\n",dataTemp512);
            printf("----------------------------read sector------------------\r\n");*/

        }
      }/*else if(countSector512>=4){
           printf("`````````````````````````one sector````````````````\r\n%s\r\n",dataTemp512);
           printf("---------------------------------------------------\r\n");
      }*/
      if (i1 == 0xa8) {
        printf("OK\r\n");
      } else if (i1 == 0x51) {
        printf("Set SD Card OK\r\n");
      } else if (i1 == 0x14) {
        printf("Success\r\n");
      } else if (i1 == 0x82) {
        printf("Error\r\n");
      } else if (i1 == 0xFF) {
        printf("Endf\r\n");
      }
      /*if(command_==100&&i1!=0x1d){ //check continue read
        printf("Endf*************-*-*-*-*-*-*-\r\n");
        command_ = 101;
        }*/
    } else {
      if (lastAscii == i1) {
        waitEnd++;
        if (waitEnd == 100 * 100) {
          for (i = addressWriteFlashTemp; i < addressWriteFlashTemp + 512; i++) {
            SST25_buffer[i - (4096 * countSector)] = dataTemp512[i - addressWriteFlashTemp];
          }
          //
          configFlash();
          //printf("$$$$$$$$$$$$$$$$$$$$$$$$$$$addressSector:%d $$$$$$$$$$$$$$$$$$$$$$$$$\r\n", addressSector);
          writeFlash(addressSector, 4096);
          addressWriteFlashTemp += countdataTemp512;
          //addressWriteFlashTemp += countdataTemp512;
          printf("wait\r\n");
          waitEnd++;
          SPI_FLASH_CS_LOW();
          SST25_R_BLOCK(0, SST25_buffer99, 4096);
          SPI_FLASH_CS_HIGH();
          Delay(0xffff);
          // printf("``%d```````````````````````end all sector````````````````\r\n\r\n", strLength);
          //printf("%s\r\n&&&&&&&&&&&&&",SST25_buffer);
          //while(1){}

          endReadFile = 1;
          for (NextPoint = pointer22char; SST25_buffer99[NextPoint] != 0x0d; NextPoint++) {
            buffer22Char[NextPoint - pointer22char] = SST25_buffer99[NextPoint];
          }
          stringToUnicodeAndSendToDisplay(buffer22Char);
          pointer22char += NextPoint + 2;
          NextPoint = pointer22char;
          printf("\r\n----------------------end---%d-----------------------\r\n", addressWriteFlashTemp);

          AmountSector = addressWriteFlashTemp / 4096;
          AmountSectorT = addressWriteFlashTemp % 4096;

          printf("d::::%s---**\r\n", SST25_buffer99);
          while (endReadFile == 1) { //4 readfe
            menu_s();
          }
        }
      }
    }

  }
}
void OpenDir() { //readf
  printf("OpenDir....\r\n");
  command_ = 0;
  //SendCH370(ResetAll, sizeof(ResetAll)); //reset chip
  printf("reset all\r\n");
  delay_ms(50);
  command_++;
  while (openDirStatus == 1) {
    if (command_ == 1) {
      SendCH370(checkConnection, sizeof(checkConnection));
      command_++; //2
      delay_ms(50);
      // printf("Check Connection str %d\r\n",myFunction());
    } else if (command_ == 2) {
      SendCH370(setSDCard, sizeof(setSDCard));
      printf("Set SD Card Mode\r\n");
      command_++; //3
      delay_ms(50);
    } else if (command_ == 3) {
      SendCH370(USBDiskMount, sizeof(USBDiskMount));
      printf("USB Disk Mount\r\n");
      command_++; //4
      delay_ms(50);
    } else if (command_ == 4) {
      SendCH370(DirName, sizeof(DirName));
      printf("Set file Name\r\n");
      command_++; //5
      delay_ms(50);
    } else if (command_ == 5) { ///FileOpen
      SendCH370(FileOpen, sizeof(FileOpen));
      printf("File Open\r\n");
      command_++; //6
      delay_ms(50);
    }
    // menu_s();
    if (USART_GetITStatus(USART3, USART_IT_RXNE) ) {
      i1 = USART_ReceiveData(USART3);
      printf("%x-%d\r\n", i1, i1);
    }
    //OpenDir
    if (command_ == 6 && i1 == 0x41) {
      openDirStatus = 0;
    }
  }
}
void setFilename(char * filename) { //setFilenameForFunction //0x00 0x57 0xab 0x2f
  int loovar = 0;
  int tempLL[14];
  SendCH370(setFilenameForFunction, sizeof(setFilenameForFunction));
  while (filename[loovar] != '\0') {
    tempLL[loovar] = filename[loovar];
    loovar++;
  }
  tempLL[loovar] = '\0';
  SendCH370(tempLL, sizeof(tempLL));
}
int createFile(char *name) {
  int  status_create = 0;
  if (command_ == 1) {
    SendCH370(checkConnection, sizeof(checkConnection));
    command_++; //2
    delay_ms(50);
  } else if (command_ == 2) {
    SendCH370(setSDCard, sizeof(setSDCard));
    command_++; //4
    delay_ms(50);
  } else if (command_ == 3) {
    SendCH370(USBDiskMount, sizeof(USBDiskMount));
    command_++; //6
    delay_ms(50);
  } else if (command_ == 4) {
    setFilename(name);
    command_++; //8
    delay_ms(50);
  } else if (command_ == 5) {
    printf("\r\nfile create \r\n");
    SendCH370(FileCreate, sizeof(FileCreate));
    delay_ms(80);
    command_++; //10
  }
  else if (command_ == 6) {
    SendCH370(FileClose, sizeof(FileClose));
    command_++; //18
    delay_ms(50);
  }
  if (USART_GetITStatus(USART3, USART_IT_RXNE) ) {
    i1 = USART_ReceiveData(USART3);
    printf("%x\r\n", i1);
  }
  if (command_ == 7 && i1 == 0x14)
    status_create = 1;

  return status_create;
}

