johnR46/BellLab_STM32/TestKey/MainB-1/USER/main.c
const char * fileName()
{
  int loop = 0;
  int count_char = 0;
  int seeT = 0;
  for (loop = 0; loop < 32; loop++) {
    if (((int)DataForWrite[loop] >= 33 && (int)DataForWrite[loop] <= 126) && DataForWrite[loop] != 42 && loop < 12) { //end of 12
      DataForWrite_aftersort[count_char] = DataForWrite[loop];
      count_char++;
    }
  }
  while (count_char < 32) {
    DataForWrite_aftersort[count_char] = 0;
    count_char++;
  }
  count_char = 0;
  while (DataForWrite_aftersort[count_char] != '\0') {
    if (DataForWrite_aftersort[count_char] == 'T' && seeT == 0) {
      if (DataForWrite_aftersort[count_char + 1] == 'B' && DataForWrite_aftersort[count_char + 2] == 'T') {
        seeT = 1;
        DataForWrite_aftersort[count_char] = '.';
        DataForWrite_aftersort[count_char + 1] = 'T';
        DataForWrite_aftersort[count_char + 2] = 'B';
        DataForWrite_aftersort[count_char + 3] = 'T';
        count_char += 3;
      }
    } else if (seeT || DataForWrite_aftersort[count_char] == 42) {
      DataForWrite_aftersort[count_char] = 0;
    }
    count_char++;
  }
  if (seeT == 1) {
    printf("this's tbt file\r\n");
  } else {
    printf("this's Dir\r\n");
  }
  return DataForWrite_aftersort;
}
void menu_CH376() {
  if (USART_GetITStatus(USART2, USART_IT_RXNE)) {
    //----------------------------- uart to key--------------------------------
    uart2Buffer = USART_ReceiveData(USART2);                                //-
    if (uart2Buffer == 0xff && SeeHead == 0) {                              //-
      SeeHead = 1;                                                          //-
      countKey = 0;                                                         //-
    }                                                                       //-
    if (countKey == 2 && uart2Buffer == 0xa4) {
      seeCur = 1;
    }
    if (countKey >= 4 && countKey <= 6) {                                   //-
      bufferKey3digit[countKey - 4] = uart2Buffer;                          //-
    }
    if (countKey == 2) //checkKeyError
    {
      checkKeyError = uart2Buffer;
    }
    countKey++;
    if (countKey >= maxData) { //Recieve & checking key
      seeHead = 0;

      if (seeCur == 1) {
        printf("see cur \r\n");
      } else {
        printf("See key %x,%x,%x\r\n", bufferKey3digit[0], bufferKey3digit[1], bufferKey3digit[2]);
      }
      if (checkKeyError == 0xff) { //check error key
        countKey = 0;
        SeeHead = 0;

      }

      printf("current mode:%d\r\n", mode);
      //printf("%d\r\n",sizeof(mode_1)/sizeof(int));
      //////////////////////////////////menu selector ///////////////////////////////////
      if (bufferKey3digit[1] != 0 || bufferKey3digit[2] != 0) { //joy menu
        // ---------------------------- to key code -----------------------------
        if (bufferKey3digit[2] == 1 || bufferKey3digit[2] == 0x20) { // joy is down
          keyCode = 40; // arrow down
          // command_++;
        }
        else if (bufferKey3digit[1] == 1 || bufferKey3digit[1] == 3 || bufferKey3digit[1] == 2) { // joy is up
          keyCode = 55;  // arrow up
        }
        else if (bufferKey3digit[1] == 128 || bufferKey3digit[2] == 0x10) { // joy is up
          keyCode = 38;  //
          //  command_=8;
        }
        else if (bufferKey3digit[1] == 64 || bufferKey3digit[2] == 8) {
          keyCode = 13; // enter
        }
        else if (bufferKey3digit[1] == 32 || bufferKey3digit[2] == 4) {
          keyCode = 8; // backspace
          ///command_ = 99;
        }
        else if (bufferKey3digit[1] == 4 ) {
          keyCode = 38; // left
          //  command_ = 97;
          //command_ = 95; //before delete
        }
        else if (bufferKey3digit[1] == 8) {
          keyCode = 40; // right
          // command_ = 98;
        }
        if (bufferKey3digit[0] == 0x9f) {
          printf("new Folder\r\n");
        }
      }
    } // end check.
    countKey = 0;
    keyCode = 0;
    seeCur = 0;
  }
}
void menu_s() {
  if (USART_GetITStatus(USART2, USART_IT_RXNE)) {
    //----------------------------- uart to key--------------------------------
    uart2Buffer = USART_ReceiveData(USART2);                                //-
    if (uart2Buffer == 0xff && SeeHead == 0) {                              //-
      SeeHead = 1;                                                          //-
      countKey = 0;                                                         //-
    }                                                                       //-
    if (countKey == 2 && uart2Buffer == 0xa4) {
      seeCur = 1;
    }
    if (countKey >= 4 && countKey <= 6) {                                   //-
      bufferKey3digit[countKey - 4] = uart2Buffer;                          //-
    }
    if (countKey == 2) //checkKeyError
    {
      checkKeyError = uart2Buffer;
    }
    countKey++;
    // ---------------------------- end uart to key ----------------------------
    // printf("[%x]\r\n",uart2Buffer);
  }
  if (countKey >= maxData) { //Recieve & checking key
    seeHead = 0;

    if (seeCur == 1) {
      printf("see cur \r\n");
    } else {
      printf("See key %x,%x,%x\r\n", bufferKey3digit[0], bufferKey3digit[1], bufferKey3digit[2]);
    }
    //printf("checkKey :%x\r\n",checkKeyError);
    if (checkKeyError == 0xff) { //check error key
      //printf("Key Error");
      countKey = 0;
      SeeHead = 0;

    }

    printf("current mode:%d\r\n", mode);
    //printf("%d\r\n",sizeof(mode_1)/sizeof(int));
    //////////////////////////////////menu selector ///////////////////////////////////
    if (bufferKey3digit[1] != 0 || bufferKey3digit[2] != 0) { //joy menu
      // ---------------------------- to key code -----------------------------
      if (bufferKey3digit[2] == 1 || bufferKey3digit[2] == 0x20) { // joy is down
        keyCode = 40; // arrow down
        // command_++;
      }
      else if (bufferKey3digit[1] == 1 || bufferKey3digit[1] == 3 || bufferKey3digit[1] == 2) { // joy is up
        keyCode = 55;  // arrow up
      }
      else if (bufferKey3digit[1] == 128 || bufferKey3digit[2] == 0x10) { // joy is up
        keyCode = 38;  //
        //  command_=8;
      }
      else if (bufferKey3digit[1] == 64 || bufferKey3digit[2] == 8) {
        keyCode = 13; // enter
      }
      else if (bufferKey3digit[1] == 32 || bufferKey3digit[2] == 4) {
        keyCode = 8; // backspace
        ///command_ = 99;
      }
      else if (bufferKey3digit[1] == 4 ) {
        keyCode = 38; // left
        //  command_ = 97;
        //command_ = 95; //before delete
      }
      else if (bufferKey3digit[1] == 8) {
        keyCode = 40; // right
        // command_ = 98;
      }
      if (bufferKey3digit[0] == 0x9f) {
        printf("new Folder\r\n");
      }
    }

